app/views/cart/createOrder.html.erb


        <% @orders.limit(1).order(id: :desc).each do |order| %>
---
SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ?  [["LIMIT", 1]]

      <tr>
        <% item = Orderitem.find_by_id(id) %>
---
SELECT  "orderitems".* FROM "orderitems" WHERE "orderitems"."id" = 28 LIMIT ?  [["LIMIT", 1]]