app/views/cart/index.html.erb

        <% @cart.each do |id, quantity| %>
        <% item = Voucher.find_by_id(id) %>
---
SELECT  "vouchers".* FROM "vouchers" WHERE "vouchers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]