app/controllers/cart_controller.rb

  def createOrder
   # Step 1: Get the current user
   @user = User.find(current_user.id)

   # Step 2: Create a new order and associate it with the current user
   @order = @user.orders.build(:order_date => DateTime.now, :status => 'Pending')
   @order.save

   # Step 3: For each item in the cart, create a new item on the order!!
   @cart = session[:cart] || {} # Get the content of the Cart
   @cart.each do | id, quantity |
   item = Voucher.find_by_id(id)
   @orderitem = @order.orderitems.build(:item_id => item.id, :title => item.title, :description => item.description, :quantity => quantity, :price=> item.price)
   @orderitem.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "orders" ("order_date", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["order_date", "2019-12-05 15:13:26.138944"], ["user_id", 1], ["status", "Pending"], ["created_at", "2019-12-05 15:13:26.155495"], ["updated_at", "2019-12-05 15:13:26.155495"]]
SELECT  "vouchers".* FROM "vouchers" WHERE "vouchers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orderitems".* FROM "orderitems" WHERE "orderitems"."id" = 28 LIMIT ?  [["LIMIT", 1]]
INSERT INTO "orderitems" ("item_id", "title", "description", "quantity", "price", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)