app/controllers/hotspots_controller.rb

  def index
    @hotspots = Hotspot.all
---
SELECT "hotspots".* FROM "hotspots"

  def create
    @hotspot = Hotspot.new(hotspot_params)

    respond_to do |format|
      if @hotspot.save
---
INSERT INTO "hotspots" ("name", "address", "price_range", "Oddeat_diet_type", "rating", "current_offers", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @hotspot.update(hotspot_params)
---
UPDATE "hotspots" SET "rating" = ?, "updated_at" = ? WHERE "hotspots"."id" = ?  [["rating", "4*"], ["updated_at", "2019-12-10 20:14:49.365620"], ["id", 1]]

    def set_hotspot
      @hotspot = Hotspot.find(params[:id])
---
SELECT  "hotspots".* FROM "hotspots" WHERE "hotspots"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]