app/controllers/orders_controller.rb

  def show
    @orderitems = Orderitem.all
    @orderitems = Orderitem.where(order_id: params[:id])
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]