app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "address", "description", "opening_hours", "price_range", "oddeat_diet_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save