app/controllers/static_pages_controller.rb

UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "Paid by User: carlalew94@gmail.com"], ["updated_at", "2019-12-06 21:35:35.011963"], ["id", 38]]
---
  def paid
    # redirect_to "/cart/clear"
    flash[:notice]='Transaction Complete'
    @order = Order.last
    @order.update_attribute(:status, "Paid by User: #{current_user.email}")

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]
---
  def paid
  # redirect_to "/cart/clear"
  @order=Order.find_by_id(params[:id])