app/controllers/vouchers_controller.rb

  def index
    @vouchers = Voucher.all
---
SELECT "vouchers".* FROM "vouchers"

  def create
    @voucher = Voucher.new(voucher_params)

    respond_to do |format|
      if @voucher.save
---
INSERT INTO "vouchers" ("title", "description", "price", "image_url", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @voucher.update(voucher_params)
---
UPDATE "vouchers" SET "title" = ?, "description" = ?, "price" = ?, "category" = ?, "updated_at" = ? WHERE "vouchers"."id" = ?  [["title", "Happy Food"], ["description", "2 course meal for 2 at Happy Food"], ["price", 0.0], ["category", "Vegan"], ["updated_at", "2019-12-10 20:23:52.799383"], ["id", 3]]

    def set_voucher
      @voucher = Voucher.find(params[:id])
---
SELECT  "vouchers".* FROM "vouchers" WHERE "vouchers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]